In [95]:
import pandas as pd
import numpy as np

## Data Frames

In [59]:
forum_users = {
    'User ID': [1, 2, 3, 4, 5],
    'Username': ['maksim_l', 'jane_shith', 'bogdan_s', 'alex123', 'mark_wilson'],
    'Age': [18, 35, 25, 38, None],
    'Joined Date': pd.to_datetime(['2023-01-01', '2014-05-01','2026-11-04','2017-07-20','2018-09-11']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     maksim_l  18.0  2023-01-01          150         500
1        2   jane_shith  35.0  2014-05-01          230         720
2        3     bogdan_s  25.0  2026-11-04           80         200
3        4      alex123  38.0  2017-07-20          420         940
4        5  mark_wilson   NaN  2018-09-11          310         500

In [60]:
df.shape

(5, 6)

In [61]:
type(df)

pandas.core.frame.DataFrame

In [62]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [63]:
type(df.columns)

pandas.core.indexes.base.Index

In [64]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [80]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [66]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [67]:
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

In [68]:
df.values

array([[1, 'maksim_l', 18.0, Timestamp('2023-01-01 00:00:00'), 150, 500],
       [2, 'jane_shith', 35.0, Timestamp('2014-05-01 00:00:00'), 230,
        720],
       [3, 'bogdan_s', 25.0, Timestamp('2026-11-04 00:00:00'), 80, 200],
       [4, 'alex123', 38.0, Timestamp('2017-07-20 00:00:00'), 420, 940],
       [5, 'mark_wilson', nan, Timestamp('2018-09-11 00:00:00'), 310,
        500]], dtype=object)

In [69]:
type(df.values)

numpy.ndarray

In [70]:
df.head()

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     maksim_l  18.0  2023-01-01          150         500
1        2   jane_shith  35.0  2014-05-01          230         720
2        3     bogdan_s  25.0  2026-11-04           80         200
3        4      alex123  38.0  2017-07-20          420         940
4        5  mark_wilson   NaN  2018-09-11          310         500

In [71]:
df.head(3)

   User ID    Username   Age Joined Date  Total Posts  Reputation
0        1    maksim_l  18.0  2023-01-01          150         500
1        2  jane_shith  35.0  2014-05-01          230         720
2        3    bogdan_s  25.0  2026-11-04           80         200

In [72]:
df.tail(2)

   User ID     Username   Age Joined Date  Total Posts  Reputation
3        4      alex123  38.0  2017-07-20          420         940
4        5  mark_wilson   NaN  2018-09-11          310         500

In [73]:
df.describe()

        User ID        Age          Joined Date  Total Posts  Reputation
count  5.000000   4.000000                    5     5.000000    5.000000
mean   3.000000  29.000000  2020-01-31 09:36:00   238.000000  572.000000
min    1.000000  18.000000  2014-05-01 00:00:00    80.000000  200.000000
25%    2.000000  23.250000  2017-07-20 00:00:00   150.000000  500.000000
50%    3.000000  30.000000  2018-09-11 00:00:00   230.000000  500.000000
75%    4.000000  35.750000  2023-01-01 00:00:00   310.000000  720.000000
max    5.000000  38.000000  2026-11-04 00:00:00   420.000000  940.000000
std    1.581139   9.201449                  NaN   133.304163  276.622486

In [74]:
df.describe().index

Index(['count', 'mean', 'min', '25%', '50%', '75%', 'max', 'std'], dtype='object')

In [75]:
df.describe().round(2)

       User ID    Age          Joined Date  Total Posts  Reputation
count     5.00   4.00                    5          5.0        5.00
mean      3.00  29.00  2020-01-31 09:36:00        238.0      572.00
min       1.00  18.00  2014-05-01 00:00:00         80.0      200.00
25%       2.00  23.25  2017-07-20 00:00:00        150.0      500.00
50%       3.00  30.00  2018-09-11 00:00:00        230.0      500.00
75%       4.00  35.75  2023-01-01 00:00:00        310.0      720.00
max       5.00  38.00  2026-11-04 00:00:00        420.0      940.00
std       1.58   9.20                  NaN        133.3      276.62

In [76]:
df.select_dtypes(include='object')

      Username
0     maksim_l
1   jane_shith
2     bogdan_s
3      alex123
4  mark_wilson

In [77]:
df.select_dtypes(include='object').columns

Index(['Username'], dtype='object')

In [78]:
df.select_dtypes(include='int')

   User ID  Total Posts  Reputation
0        1          150         500
1        2          230         720
2        3           80         200
3        4          420         940
4        5          310         500

In [79]:
df.isna()

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False   True        False        False       False

In [81]:
df.values[2, 3]

Timestamp('2026-11-04 00:00:00')

In [82]:
df.values[0, 1]

'maksim_l'

## Series

In [85]:
username_siries = df['Username']
username_siries

0       maksim_l
1     jane_shith
2       bogdan_s
3        alex123
4    mark_wilson
Name: Username, dtype: object

In [86]:
type(username_siries)

pandas.core.series.Series

In [87]:
username_siries.values

array(['maksim_l', 'jane_shith', 'bogdan_s', 'alex123', 'mark_wilson'],
      dtype=object)

In [88]:
username_siries.index

RangeIndex(start=0, stop=5, step=1)

In [89]:

df['Username'].value_counts()

Username
maksim_l       1
jane_shith     1
bogdan_s       1
alex123        1
mark_wilson    1
Name: count, dtype: int64

In [90]:
df['Reputation'].value_counts()

Reputation
500    2
720    1
200    1
940    1
Name: count, dtype: int64

In [91]:
df['Reputation'].value_counts(ascending=True)

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [92]:
df['Reputation'].unique()

array([500, 720, 200, 940])

In [93]:
df['Username'].sort_values()

3        alex123
2       bogdan_s
1     jane_shith
0       maksim_l
4    mark_wilson
Name: Username, dtype: object

In [94]:
df['Username'].sort_values(ascending=False)

4    mark_wilson
0       maksim_l
1     jane_shith
2       bogdan_s
3        alex123
Name: Username, dtype: object